{
  "plugin": {
    "AccountInfo": {
      "text": "\"View Account Assets\" and \"Copy Account Status\" buttons will not appear.",
      "ver": "~157.0"
    },
    "AccountSwitcher": {
      "text": "Attempting to switch accounts using this plugin will cause your Discord to crash forever. The only fix is to completely reinstall Discord.",
      "ver": "~156.0(?)"
    },
    "AddonManager":{
      "text": "Attempting to open the addon manager will cause React to crash.",
      "ver": "~162.0"
    },
    "AllReplyMention": {
      "text": "Replies without pings will not show up in the notifications center.",
      "ver": "Unknown"
    },
    "Catboys": {
      "text": "Plugin will not load at all.\n\nError: Fatal error with Catboys.js: [TypeError: Cannot read property 'React' of undefined]",
      "ver": "Unknown"
    },
    "Catgirls": {
      "text": "Plugin will not load at all.\n\nError: Fatal error with Catgirls.js: [TypeError: Cannot read property 'React' of undefined]",
      "ver": "Unknown"
    },
    "CopyEmbeds": {
      "text": "The \"Copy Embed\" button inside the message context menu might break other functions.",
      "ver": "Unknown"
    },
    "CutMessage": {
      "text": "Cut Message button does not appear in the message context menu.",
      "ver": "Unknown"
    },
    "Dislate": {
      "text": "/dislate type:Debug does not open the dedicated Debug Menu.",
      "ver": "~162.0"
    },
    "Downloader": {
      "text": "Download button does not appear in the link context menu.",
      "ver": "~156.0"
    },
    "EmbedFailFixup": {
      "text": "Plugin does not replace media.discordapp.com links with cdn.discordapp.com links.",
      "ver": "~148.0"
    },
    "EnableStaging": {
      "text": "Plugin may cause random crashes. Disabling and re enabling the plugin should fix most issues temporarily. Some experiments can crash Discord as well. This plugin will make your Discord crash infinitely if you encountered a crash. The plugin might prompt you to restart Discord over and over when the plugin is in its disabled state.",
      "ver": "~157.0"
    },
    "K2geLocker": {
      "text": "No noticeable issues.\n\nError: Could not fire before patch for type of K2geLocker [TypeError: Cannot set property 'opacity' of undefined]",
      "ver": "~163.0"
    },
    "NSFWGateBypass": {
      "text": "Plugin might not bypass NSFW server and channel restrictions.",
      "ver": "~148.0"
    },
    "Osu": {
      "text": "Player stats will not be shown when running the slash command.",
      "ver": "~157.0"
    },
    "ShowAllActivities": {
      "text": "Plugin does not show all activities sometimes. It can also crash Discord when connecting to a Voice Channel",
      "ver": "~157.0"
    },
    "ShowHiddenChannels": {
      "text": "Enabling and disabling the plugin repeatedly will cause the lock icon shown next to hidden channels to duplicate itself. \"Last message sent\" timestamp in hidden channels is not always accurate. Hidden Channels will not be shown in channel list if you are on Discord version 157.0 or below. Hidden channels should be displayed correctly between Discord versions 158.0 to 162.0. Hidden channels' locked page with the \"Last message sent\" timestamp will not be shown in Discord version 163.0.\n\nError: ShowHiddenChannels failed to load second argument \"mdl\" must be of type function or object",
      "ver": "158.0~162.0"
    },
    "Timestamps": {
      "text": "Plugin does not replace normal timestamps with unix timestamps.",
      "ver": "~148.0"
    },
    "Unfurl": {
      "text": "Link will not generate after running the slash command",
      "ver": "Unknown"
    },
    "UserDetails": {
      "text": "User account creation date and server joined date will not appear. Discord has this feature built in with newer Discord versions.",
      "ver": "~157.0"
    },
    "wttr": {
      "text": "Plugin will not load at all.\n\nError: Fatal error with wttr.js: [TypeError: Cannot read property 'React' of undefined]",
      "ver": "Unknown"
    }
  },
  "theme": {
  }
}
