{
  "description": "Dislate  \n\n - Allows you to translate other peoples' messages into a desired language and back as simply as long-pressing on a message, using the Google Translate API.\n - Also allows you to send messages in a different language with the `/translate` command and a confirmation popup will appear to make sure that the message sent is correct.\n - As well as this, it allows you to pick from a list of many languages supported by the API, and has been adapted to look appealing to use in all aspects of the plugin.\n ——————————~~——————————\nInstall: \n<enmity://enmity?id=-1&command=install-plugin&params=https://raw.githubusercontent.com/acquitelol/dislate/main/dist/Dislate.js>\nDownload: \nhttps://raw.githubusercontent.com/acquitelol/dislate/main/dist/Dislate.js\nSource: \nhttps://github.com/acquitelol/dislate/tree/main/src\n\nCurrent latest version: 1.2.1 stable   \n ——————————~~——————————\nMajor Release (1.2.1) Changelog:\n  • Rewrite of the entire codebase, including adding extensive JSDoc to all code files to describe in detail what each part does which should all now be consistent.\n  • Updated the design on the language pages and the Debug Info page in `/dislate` type:Debug, including a rounded custom implementation for the FormSection React Native component.\n  • Added tips in specific menus to allow the user to understand what the menu is representing because it might seem cluttered. \n  • Added ability to abbreviate a language when you translate another user's message (\"text `[English]`\" turns to \"text `[EN]`\") and also added ability both the Original and Translated message with `/translate` instead of just the Translated message beforehand.\n  • Removed specific utility functions which are not required throughout the plugin, such as `push_item` and `array_length`, and merged many functions into less files.\n  • Abstracted components which are used often or require their own state into a seperate component to reduce clutter inside of the main component, including the SectionWrapper and ExitWrapper which is used extensively throughout the UI components, especially in `/dislate` type:Debug and in the plugin's Settings page.\n  • Removed Repository Button from `/dislate` and added `Clear Stores` instead to clear specific storage items and settings. Both repository and clear store options are available in settings.\nOverall second major update \n(Total lines of code in source: ~4000 )",
  "images": [],
  "videos": []
}